ТОИР_демо/src/Documents/торо_РегистрацияЗначенийВнешнихПоказателейKPI/торо_РегистрацияЗначенийВнешнихПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_РегистрацияЗначенийВнешнихПоказателейKPI</name>
  <registerRecords>AccumulationRegister.торо_ЗначенияВнешнихПоказателейKPI</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПоказателей</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.торо_ПоказателиKPI</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТОИР_демо/src/AccumulationRegisters/торо_ЗначенияВнешнихПоказателейKPI/торо_ЗначенияВнешнихПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ЗначенияВнешнихПоказателейKPI</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.торо_ПоказателиKPI</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ТОИР_демо/src/Enums/торо_ТипыПоказателейKPI/торо_ТипыПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыПоказателейKPI</name>
  <enumValues>
    <name>ПоказательОбъектаРемонта</name>
  </enumValues>
  <enumValues>
    <name>ПоказательПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ПоказательОрганизации</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Documents/торо_РегистрацияЗначенийВнешнихПоказателейKPI/ObjectModule.bsl
#Область ОбработчикиСобытий

перем СтруктураДанных Экспорт;  // Структура, хранящая данные для работы с уведомлениями.

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный");
	Если НЕ ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ШаблонСообщения = НСтр("ru='Не заполнена колонка ""%2"" в строке %1 списка ""Значения показателей""'");
	
	Для каждого СтрокаЗначения из ЗначенияПоказателей Цикл
		ОбязательноПодразделение = Ложь;
		ОбязательноОР = Ложь;
		Если СтрокаЗначения.Показатель.ТипПоказателя = Перечисления.торо_ТипыПоказателейKPI.ПоказательОбъектаРемонта Тогда
			ОбязательноПодразделение = Истина;
			ОбязательноОР = Истина;
		ИначеЕсли СтрокаЗначения.Показатель.ТипПоказателя = Перечисления.торо_ТипыПоказателейKPI.ПоказательПодразделения Тогда
			ОбязательноПодразделение = Истина;
		КонецЕсли;
		
		ИндексСтроки = СтрокаЗначения.НомерСтроки - 1;
		Если ОбязательноПодразделение И НЕ ЗначениеЗаполнено(СтрокаЗначения.Подразделение) Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаЗначения.НомерСтроки, НСтр("ru='Подразделение'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ЗначенияПоказателей["+ИндексСтроки+"].Подразделение",,Отказ);
		КонецЕсли;
		Если ОбязательноОР И НЕ ЗначениеЗаполнено(СтрокаЗначения.ОбъектРемонта) Тогда
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаЗначения.НомерСтроки, НСтр("ru='Объект ремонта'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ЗначенияПоказателей["+ИндексСтроки+"].ОбъектРемонта",,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр торо_ЗначенияВнешнихПоказателейKPI
	Движения.торо_ЗначенияВнешнихПоказателейKPI.Записывать = Истина;
	Движения.торо_ЗначенияВнешнихПоказателейKPI.Очистить();
	Для Каждого ТекСтрокаЗначенияПоказателей Из ЗначенияПоказателей Цикл
		Движение = Движения.торо_ЗначенияВнешнихПоказателейKPI.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = Организация;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаЗначенияПоказателей);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
